Chapter12/Exercise12.02/citireview/app/controllers/comments_controller.rb

    def create
        @review = Review.find(params[:review_id])
        @comment = @review.comments.create(comment_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "review_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Alex W"], ["body", "Totally agree with this review"], ["review_id", 3], ["created_at", "2019-08-01 13:16:34.220000"], ["updated_at", "2019-08-01 13:16:34.220000"]]