Chapter12/Exercise12.02/citireview/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ssa"], ["description", "ssr"], ["created_at", "2019-07-20 12:29:49.918831"], ["updated_at", "2019-07-20 12:29:49.918831"]]
---
    def create
        parameters = params[:review]
        @review = Review.new(name: parameters[:name], description: parameters[:description])

        @review.save