Chapter12/Exercise12.02/citireview/app/views/reviews/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."review_id" = ?  [["review_id", 3]]
---
<strong><i>Comments for this review:</i></strong>
<% @review.comments.each do |comment| %>